AnMaLeNo/pc-power-controller/esp8266/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <PubSubClient.h>

// Configuration
const char* ssid = WIFI_SSID;
const char* password = WIFI_PASS;
const char* mqtt_server = MQTT_SERVER;
const uint16_t mqtt_port = 1883;

// Topiques MQTT
const char* topic_command = "bureau/pc/power/set";
const char* topic_state   = "bureau/pc/power/log";

// Hardware
const int pinOpto = D1;
const int pinLed = LED_BUILTIN;

WiFiClient wifiNetworkClient;
PubSubClient mqttClient(wifiNetworkClient);

// Impulsion matérielle : la fin est déléguée au timer1 (ISR one-shot), donc la
// durée reste bornée même si la boucle principale est bloquée (ex. connect()
// MQTT pendant une panne réseau). Contrainte : timer1 doit rester libre, donc
// pas d'analogWrite/tone/Servo dans ce firmware.
volatile bool pulseActive = false;
const uint32_t SHORT_PRESS_DURATION = 300;
const uint32_t LONG_PRESS_DURATION = 6000;
// Action en cours, corrélée à l'ACK pulse_end. Littéraux uniquement : l'ISR
// recopie le pointeur, jamais le contenu.
const char* pulseAction = "";
// Fin d'impulsion signalée par l'ISR ; l'ACK MQTT est publié depuis la boucle
// principale (interdiction de publier depuis une ISR).
const char* volatile endedAction = "";
volatile bool pulseEndPending = false;

// Définition des états de l'automate réseau (FSM)
enum NetworkState {
    NET_INIT,
    NET_WIFI_CONNECTING,
    NET_WIFI_WAIT,
    NET_MQTT_CONNECTING,
    NET_CONNECTED,
    NET_COOLDOWN
};

NetworkState netState = NET_INIT;
uint32_t lastNetworkAttempt = 0;
// Timeout d'association WiFi + DHCP : assez large pour les box lentes (sinon
// l'ESP abandonne avant la fin de la négociation et boucle indéfiniment).
const uint32_t WIFI_CONNECT_TIMEOUT = 20000;
// Délai de temporisation avant une nouvelle tentative après un échec.
const uint32_t COOLDOWN_DURATION = 5000;

// Dimensionné pour le plus long ACK JSON (pulse_start/end avec action + ts 32 bits).
char buffer[80];
const uint16_t MESSAGE_MAX_LENGTH = 20;

// Déclaration préalable des fonctions
void startPulse(uint32_t duration, const char* action);
void handlePulseAck();
void processNetworkFSM();

void callback(char* topic, byte* payload, unsigned int length) {
    char message[MESSAGE_MAX_LENGTH + 1];
    if (length > MESSAGE_MAX_LENGTH) {
        mqttClient.publish(topic_state, "{\"event\":\"error\",\"reason\":\"payload_too_large\"}");
        Serial.printf("payload trop grand, size: %d, max: %d\n", length, MESSAGE_MAX_LENGTH);
        return;
    }

    memcpy(message, payload, length);
    message[length] = '\0';
    Serial.printf("Message reçu [%s] %s\n", topic, message);

    if (strcmp(topic, topic_command) == 0) {
        if (strcmp(message, "SHORT_PRESS") == 0) {
            startPulse(SHORT_PRESS_DURATION, "SHORT_PRESS");
        } else if (strcmp(message, "LONG_PRESS") == 0) {
            startPulse(LONG_PRESS_DURATION, "LONG_PRESS");
        } else {
            mqttClient.publish(topic_state, "{\"event\":\"error\",\"reason\":\"unknown_command\"}");
            Serial.printf("Message [%s] inconnu\n", message);
        }
    }
}

// Fin d'impulsion en contexte d'interruption : s'exécute à l'échéance exacte,
// y compris pendant un appel réseau bloquant de la boucle principale.
IRAM_ATTR void onPulseEnd() {
    digitalWrite(pinOpto, LOW);
    digitalWrite(pinLed, HIGH);
    endedAction = pulseAction;
    pulseEndPending = true;
    pulseActive = false;
}

void startPulse(uint32_t duration, const char* action) {
    if (pulseActive) {
        mqttClient.publish(topic_state, "{\"event\":\"error\",\"reason\":\"pulse_already_active\"}");
        Serial.print("Pulse already active\n");
        return;
    }
    pulseAction = action;
    pulseActive = true;

    digitalWrite(pinOpto, HIGH);
    digitalWrite(pinLed, LOW);

    // One-shot timer1 en TIM_DIV256 : 80 MHz / 256 = 312,5 ticks/ms, d'où
    // ticks = ms * 625 / 2 (durées paires ici, division exacte). Max 23 bits
    // = ~26,8 s, largement au-dessus du LONG_PRESS.
    timer1_enable(TIM_DIV256, TIM_EDGE, TIM_SINGLE);
    timer1_write((duration * 625UL) / 2);

    // Publié après l'armement : un blocage réseau ne peut plus retarder la
    // libération de la broche, elle appartient désormais au timer.
    snprintf(buffer, sizeof(buffer),
             "{\"event\":\"pulse_start\",\"action\":\"%s\",\"ts\":%lu}", action, millis());
    mqttClient.publish(topic_state, buffer);
    Serial.print("Start pulse\n");
}

// Publie l'ACK de la fin d'impulsion signalée par l'ISR. Le ts est celui de la
// publication ; la broche, elle, a été libérée pile à l'échéance par le timer.
void handlePulseAck() {
    if (!pulseEndPending) return;
    pulseEndPending = false;

    if (mqttClient.connected()) {
        snprintf(buffer, sizeof(buffer),
                 "{\"event\":\"pulse_end\",\"action\":\"%s\",\"ts\":%lu}", endedAction, millis());
        mqttClient.publish(topic_state, buffer);
    }
    Serial.print("End pulse\n");
}

void processNetworkFSM() {
    uint32_t now = millis();

    switch (netState) {
        case NET_INIT:
            WiFi.persistent(false);
            WiFi.mode(WIFI_STA);
            WiFi.setAutoConnect(false);     // Désactivation de la FSM interne d'Espressif (L2)
            WiFi.setAutoReconnect(false);   // Reprise du contrôle logiciel absolu de la couche liaison
            netState = NET_WIFI_CONNECTING;
            break;

        case NET_WIFI_CONNECTING:
            Serial.printf("Connexion au WiFi: %s\n", ssid);
            WiFi.begin(ssid, password);
            lastNetworkAttempt = now;
            netState = NET_WIFI_WAIT;
            break;

        case NET_WIFI_WAIT:
            if (WiFi.status() == WL_CONNECTED) {
                Serial.printf("\nWiFi connecté. IP: %s\n", WiFi.localIP().toString().c_str());
                netState = NET_MQTT_CONNECTING;
            } else if (now - lastNetworkAttempt >= WIFI_CONNECT_TIMEOUT) {
                Serial.println("\nTimeout WiFi. Bascule en Cooldown.");
                WiFi.disconnect();
                lastNetworkAttempt = now;
                netState = NET_COOLDOWN;
            }
            break;

        case NET_MQTT_CONNECTING:
            if (WiFi.status() != WL_CONNECTED) {
                netState = NET_WIFI_CONNECTING;
                break;
            }

            {
                String clientId = "ESP8266Client-" + WiFi.macAddress();
                clientId.replace(":", "");
                Serial.printf("Tentative MQTT %s:%u\n", mqtt_server, mqtt_port);
                
                // Appel synchrone encapsulé - Blocage borné par le timeout LwIP/PubSubClient
                if (mqttClient.connect(clientId.c_str())) {
                    Serial.println("Connecté au serveur MQTT !");
                    mqttClient.subscribe(topic_command);
                    netState = NET_CONNECTED;
                } else {
                    Serial.printf("Echec MQTT rc=%d. Bascule en Cooldown.\n", mqttClient.state());
                    lastNetworkAttempt = now;
                    netState = NET_COOLDOWN;
                }
            }
            break;

        case NET_CONNECTED:
            if (WiFi.status() != WL_CONNECTED || !mqttClient.connected()) {
                Serial.println("Perte de liaison (L2 ou L7).");
                netState = NET_COOLDOWN;
                lastNetworkAttempt = now;
            } else {
                mqttClient.loop(); // Traitement des buffers réseau entrants
            }
            break;

        case NET_COOLDOWN:
            // Interdiction stricte de toute opération réseau pendant la fenêtre de temporisation
            if (now - lastNetworkAttempt >= COOLDOWN_DURATION) {
                netState = (WiFi.status() == WL_CONNECTED) ? NET_MQTT_CONNECTING : NET_WIFI_CONNECTING;
            }
            break;
    }
}

void setup() {
    Serial.begin(115200);
    pinMode(pinOpto, OUTPUT);
    pinMode(pinLed, OUTPUT);
    
    // Initialisation de l'état nominal physique (Safe state)
    digitalWrite(pinOpto, LOW);
    digitalWrite(pinLed, HIGH);

    // Timer matériel dédié à la fin d'impulsion (one-shot armé par startPulse)
    timer1_isr_init();
    timer1_attachInterrupt(onPulseEnd);

    mqttClient.setServer(mqtt_server, mqtt_port);
    mqttClient.setCallback(callback);
}

void loop() {
    // Ordonnancement coopératif à complexité amortie O(1)
    handlePulseAck();      // Publication différée des ACK de fin d'impulsion
    processNetworkFSM();   // Traitement asynchrone non-bloquant du vecteur réseau
}